
"Messages.UnreadMark" = "Nieprzeczytane wiadomości";
"Messages.ForwardHeader" = "Przekazane wiadomości";
"Messages.File.State.FetchingIn" = "pobrano %d%%";
"Messages.File.State.FetchingOut" = "wysłano %d%%";
"Messages.File.State.Remote" = "Pobierz";
"Messages.File.State.Local" = "Pokaż w Finderze";
"Messages.DeletedMessage" = "Usunięta wiadomość";

"Messages.Placeholder.SentMessage" = "Napisz wiadomość…";
"SearchField.Search" = "Szukaj";
"Contacts.ContacsSeparator" = "Kontakty";
"Navigation.back" = "Wstecz";
"Navigation.Chat" = "Czat";
"Navigation.Edit" = "Edytuj";
"Navigation.Done" = "Gotowe";
"Navigation.Close" = "Zamknij";
"Navigation.Cancel" = "Anuluj";

"Gallery.Counter" = "%d z %d";

"Peer.Status.bot" = "bot";
"Peer.Status.offline" = "offline";
"Peer.Status.online" = "online";
"Peer.Status.recently" = "ostatnio widziano niedawno";
"Peer.Status.justNow" = "ostatnio widziano przed chwilą";
"Peer.Status.lastWeek" = "ostatnio widziano w ciągu tygodnia";
"Peer.Status.lastMonth" = "ostatnio widziano w ciągu miesiąca";

"Peer.Status.Today" = "dzisiaj";
"Peer.Status.Yesterday" = "wczoraj";
"Peer.Status.LastSeenAt" = "last seen %@ at %@";

"Peer.Status.Member.zero" = "%d członków";
"Peer.Status.Member.singular" = "%d członek";
"Peer.Status.Member.pluar" = "%d członków";
"Peer.Status.Member.Online" = "%d online";

"Peer.Status.minAgo.zero" = "last seen %d minutes ago";
"Peer.Status.minAgo.singular" = "last seen %d minute ago";
"Peer.Status.minAgo.pluar" = "last seen %d minutes ago";

"Peer.Status.channel" = "kanał";
"Peer.Status.group" = "grupa";

"Telegram.PeerInfoController" = "Informacje";
"PeerInfo.SendMessage" = "Wyślij wiadomość";
"PeerInfo.ShareContact" = "Udostępnij kontakt";
"PeerInfo.StartSecretChat" = "Rozpocznij szyfrowany czat";
"PeerInfo.SharedMedia" = "Udostępnione multimedia";
"PeerInfo.Notifications" = "Powiadomienia";
"PeerInfo.BlockUser" = "Blokuj użytkownika";
"PeerInfo.UnblockUser" = "Odblokuj użytkownika";
"PeerInfo.username" = "nazwa użytkownika";
"PeerInfo.about" = "o…";
"PeerInfo.info" = "Informacje";
"PeerInfo.SetGroupPhoto" = "Ustaw zdjęcie grupy";
"PeerInfo.AddMember" = "Dodaj członka";
"PeerInfo.DeleteAndExit" = "Usuń i wyjdź";
"PeerInfo.LeaveChannel" = "Opuść kanał";
"PeerInfo.Report" = "Zgłoś";
"PeerInfo.sharelink" = "udostęnij link";
"PeerInfo.Confirm.LeaveChannel" = "Czy na pewno chcesz opuścić\nten kanał?";
"PeerInfo.Confirm.DeleteAndExit" = "Czy na pewno chcesz opuścić\nten kanał?";
"PeerInfo.Confirm.LeaveGroup" = "Czy jesteś pewien, że chcesz opuścić tę grupę?\n\nTa czynność nie może być cofnięta.";
"PeerInfo.Confirm.DeleteChat" = "Are you sure you want to delete all message history and leave \"%@\"?\n\nThis action cannot be undone.";
"Confirm.DeleteAdminedChannel" = "Czekaj! Usunięcie tego kanału spowoduje usunięcie wszystkich członków i wszystkie wiadomości zostaną utracone. Mimo to usunąć kanał?";
"Confirm.DeleteChatUser" = "Are you sure you want to delete all message history?\n\nThis action cannot be undone.";
"Confirm.LeaveGroup" = "Czy na pewno chcesz opuścić tę grupę?";

"PeerMedia.SharedMedia" = "Udostępnione multimedia";
"EmptyPeer.Description" = "Wybierz czat aby rozpocząć rozmowę";

"Emoji.Recent" = "Często używane";
"Emoji.SmilesAndPeople" = "Buźki i ludzie";
"Emoji.AnimalsAndNature" = "Zwierzęta i natura";
"Emoji.FoodAndDrink" = "Jedzenie i picie";
"Emoji.ActivityAndSport" = "Aktywność i sport";
"Emoji.TravelAndPlaces" = "Podróże i miejsca";
"Emoji.Objects" = "Obiekty";
"Emoji.Symbols" = "Symbole";
"Emoji.Flags" = "Flagi";


"Chat.DropTitle" = "Upuść tu pliki, aby je wysłać";
"Chat.DropQuickDesc" = "w szybki sposób";
"Chat.DropAsFilesDesc" = "bez kompresji";

"Message.ActionsPanel.Delete" = "Usuń";
"Message.ActionsPanel.Forward" = "Przekaż";
"Message.ActionsPanel.EmptySelected" = "Zaznacz wiadomość";



"Message.ActionsPanel.SelectedCount.zero" = "zaznaczone wiadomości - %d";
"Message.ActionsPanel.SelectedCount.singular" = "%d zaznaczona wiadomość";
"Message.ActionsPanel.SelectedCount.pluar" = "zaznaczone wiadomości - %d";

"Message.AccessoryPanel.Forwarded.zero" = "przekazane wiadomości - %d";
"Message.AccessoryPanel.Forwarded.singular" = "%d przekazana wiadomość";
"Message.AccessoryPanel.Forwarded.pluar" = "przekazane wiadomości - %d";

"ForwardModalAction.Title.zero" = "Przekazywanie wiadomości";
"ForwardModalAction.Title.singular" = "Przekazywanie wiadomości";
"ForwardModalAction.Title.pluar" = "Przekazywanie wiadomości";

"ForwardModalAction.description.zero" = "Wybierz użytkownika lub czat do przekazania wiadomości od %@";
"ForwardModalAction.description.singular" = "Wybierz użytkownika lub czat do przekazania wiadomości od %@";
"ForwardModalAction.description.pluar" = "Wybierz użytkownika lub czat do przekazania wiadomości od %@";

"ModalAction.ShareContact" = "Udostępnij kontakt";

"Alert.OK" = "OK";
"Alert.Cancel" = "Anuluj";

"Alert.Pasteboard.SendMultiple.zero" = "Chcesz wysłać ze schowka plików - %d?";
"Alert.Pasteboard.SendMultiple.singular" = "Chcesz wysłać ze schowka plików - %d?";
"Alert.Pasteboard.SendMultiple.pluar" = "Chcesz wysłać ze schowka plików - %d?";
"Alert.Forward.Error" = "Nie można przesłać wiadomości do tej konwersacji.";

"Alert.Pasteboard.SendMultiple.Desc" = "You can always send pictures and files by copying and pasting them into a Telegram chat.";

"PreviewSender.CompressFile" = "Send as compressed";
"PreviderSender.CaptionPlaceholder" = "Podpis…";
"PreviderSender.CommentPlaceholder" = "Komentarz...";
"Modal.Send" = "Wyślij";
"Modal.Share" = "Udostęnij";
"Modal.CopyLink" = "Kopiuj link";
"Modal.Cancel" = "Anuluj";
"Modal.OK" = "OK";

"QuickLook.Preview" = "Podgląd";


"Chat.Service.You" = "Ty";
"Chat.Service.Group.Created" = "Użytkownik %@ utworzył grupę \"%@\"";
"Chat.Service.Group.AddedMembers" = "Użytkownik %@ zaprosił %@";
"Chat.Service.Group.AddedSelf" = "Użytkownik %@ dołączył do grupy";
"Chat.Service.Group.RemovedMembers" = "Użytkownik %@ usunął %@";
"Chat.Service.Group.RemovedSelf" = "Użytkownik %@ opuścił grupę";
"Chat.Service.Group.UpdatedPhoto" = "%@ updated group photo";
"Chat.Service.Group.RemovedPhoto" = "Użytkownik %@ usunął zdjęcie grupy";
"Chat.Service.Group.UpdatedTitle" = "Użytkownik %@ zmienił nazwę grupy na „%@”";
"Chat.Service.Group.UpdatedPinnedMessage" = "%@ przypiął \"%@\"";
"Chat.Service.Group.RemovedPinnedMessage" = "%@ removed pinned message";
"Chat.Service.Group.JoinedByLink" = "%@ dołączył do grupy przez link zaproszenia";
"Chat.Service.Group.MigratedToSupergroup" = "Grupa ta została zmieniona na super grupę";
"Chat.Service.Group.TookScreenshot" = "%@ zrobił zrzut ekranu";
"Chat.Service.PinnedMessage" = "przypięta wiadomość";

"Chat.Service.Channel.UpdatedPhoto" = "zdjęcie kanału zaktualizowane";
"Chat.Service.Channel.RemovedPhoto" = "usunięto zdjęcie kanału";
"Chat.Service.Channel.UpdatedTitle" = "kanał przemianowany";


"Chat.Service.SecretChat.SetTimer" = "%@ set the self-destruct timer to %@";
"Chat.Service.SecretChat.SetTimer.Self" = "Ustawiłeś licznik samozniszczenia na %@";
"Chat.Service.SecretChat.DisabledTimer" = "%@ disabled the self-destruct timer";
"Chat.Service.SecretChat.DisabledTimer.Self" = "Wyłączyłeś somozniszczenie wiadomości";

"Chat.Input.Mute" = "Wyłącz  powiadomienia";
"Chat.Input.Unmute" = "Włącz powiadomienia";
"Chat.Input.Return" = "Powrót do grupy";
"Chat.Input.ExchangingKeys" = "Wymieniam klucze";
"Chat.Input.SecretChat.WaitingToOnline" = "Waiting for the user to come online...";
"Chat.Input.Delete" = "Usuń i wyjdź";
"Chat.Input.Join" = "Dołącz";
"Chat.Input.Unblock" = "Odblokuj";

"Message.Context.Reply" = "Odpowiedz (podwójne kliknięcie)";
"Message.Context.Forward" = "Przekaż";
"Message.Context.Delete" = "Usuń";
"Message.Context.Select" = "Zaznacz";
"Message.Context.Edit" = "Edytuj";
"Message.Context.Goto" = "Pokaż wiadomość";
"Message.Context.Pin" = "Przypnij";
"Message.Context.Confirm.Pin" = "Przypiąć tę wiadomość i powiadomić wszystkich członków grupy?";
"Message.Context.Confirm.OnlyPin" = "Pin only";

"Entertainment.Switch.GifAndStickers" = "Naklejki i GIFy";
"Entertainment.Switch.Emoji" = "Emoji";
"Telegram.LayoutAccountController" = "Konto:";

"AccountSettings.SetProfilePhoto" = "Ustaw zdjęcie profilowe";
"AccountSettings.General" = "Ogólne";
"AccountSettings.Stickers" = "Naklejki";
"AccountSettings.Notifications" = "Powiadomienia";
"AccountSettings.Username" = "Nazwa użytkownika";
"AccountSettings.PhoneNumber" = "Numer telefonu";
"AccountSettings.PrivacyAndSecurity" = "Prywatność i bezpieczeństwo";
"AccountSettings.Accounts" = "Account Management";

"AccountSettings.About" = "O programie…";
"AccountSettings.FAQ" = "Telegram FAQ";
"AccountSettings.AskQuestion" = "Zadaj pytanie";

"ConnectingStatus.connecting" = "łączenie";
"ConnectingStatus.online" = "online";
"ConnectingStatus.updating" = "aktualizacja…";
"ConnectingStatus.waitingNetwork" = "czekam na sieć";


"Chat.ConnectingStatus.connecting" = "Łączenie";
"Chat.ConnectingStatus.updating" = "Aktualizacja";
"Chat.ConnectingStatus.waitingNetwork" = "Czekam na sieć";

"InputAttach.Popover.PhotoOrVideo" = "Zdjęcie lub wideo";
"InputAttach.Popover.Picture" = "Picture";
"InputAttach.Popover.File" = "Plik";
"InputAttach.Popover.Location" = "Lokalizacja";

"Compose.Popover.NewGroup" = "Nowa grupa";
"Compose.Popover.NewChannel" = "Nowy kanał";
"Compose.Popover.NewSecretChat" = "Nowy szyfrowany czat";


"Chat.Cancel" = "Anuluj";
"Gallery.Context.SaveAs" = "Zapisz jako…";
"Gallery.Context.ShowMessage" = "Pokaż wiadomość";
"Gallery.Context.CopyToClipboard" = "Kopiuj do schowka";


"Chat.Input.Accessory.EditMessage" = "Edytuj wiadomość";
"Chat.Message.edited" = "edytowana";

"PeerMedia.Popover.SharedMedia" = "Udostępnione multimedia";
"PeerMedia.Popover.SharedFiles" = "Udostępnione pliki";
"PeerMedia.Popover.SharedLinks" = "Udostępnione linki";
"PeerMedia.Popover.SharedAudio" = "Shared Audio";
"Chat.Message.Via" = "przez";

"Audio.UnknownArtist" = "Nieznany artysta";
"Audio.UntitledSong" = "Untitled";

"AudioController.voiceMessage" = "wiadomość głosowa";
"You" = "Ty";


"Login.WelcomeDescription" = "Witamy w Telegramie dla macOS";
"Login.countryLabel" = "kraj";
"Login.yourPhoneLabel" = "twój numer";
"Login.phoneFieldPlaceholder" = "numer telefonu";
"Login.Next" = "Dalej";

"Login.InvalidCountryCode" = "Niewłaściwy kod kraju";
"Login.codePlaceholder" = "kod";


"Login.EnterCodeFromApp" = "Wpisz kod, który właśnie odebrano w Telegramie na innym urządzeniu.";
"Login.SendSmsIfNotReceivedAppCode" = "Nie otrzymano kodu?";
"Login.JustSentSms" = "Wysłaliśmy do ciebie SMS z kodem. Wprowadź go powyżej.";
"Login.PhoneCalledCode" = "We’ve just called your number. Please enter the code above.";
"Login.PhoneDialed" = "Telegram wybrał twój numer";
"Login.willCall" = "Telegram zadzwoni do ciebie za %d:%@";
"Login.willSendSms" = "Telegram wyśle ci wiadomość SMS za %d:%@";
"Login.passwordPlaceholder" = "hasło";
"Login.StartMessaging" = "Uruchom komunikator";

"Login.EnterPasswordDescription" = "You have enabled Two-Step Verification, your account is now protected with an additional password.";
"Login.forgotPassword" = "Zapomniałeś hasło?";
"Login.RecoveryMailFailed" = "Since you haven't provided a recovery e-mail during the setup of your password, your remaining options are either to remember your password or to reset your account.";

"Login.ResetAccount" = "RESETUJ MOJE KONTO";
"Login.ResetAccountDescription" = "All your chats and messages, along with any media and files you shared will be lost if you proceed with resetting your account.";
"Login.ResetAccount" = "RESETUJ MOJE KONTO";

"PHONE_NUMBER_INVALID" = "nieprawidłowy numer telefonu";
"Login.FloodWait" = "zbyt wiele prób, spróbuj później.";
"PHONE_CODE_INVALID" = "nieprawidłowy kod telefonu";
"PHONE_CODE_EXPIRED" = "code expired";
"PASSWORD_HASH_INVALID" = "Nieprawidłowe hasło";



"Chat.ForwardActionHeader" = "Przekaż wiadomości";
"AudioRecord.ReleaseOut" = "Puść poza tym polem, by anulować";


"GeneralSettings.LargeFonts" = "Large Message Font";
"GeneralSettings.MutedChatsInUnread" = "Zawrzyj wyciszone czaty w liczniku nieprzeczytanych";
"GeneralSettings.MediaKeysForInAppPlayer" = "Obsługuj klawisze multimedialne we wbudowanym odtwarzaczu.";
"GeneralSettings.EmojiSidebar" = "Emoji/Stickers sidebar";
"GeneralSettings.ContactsJoined" = "Kontakt dołączył do Telegramu";
"GeneralSettings.DownloadSettings" = "Download Settings";
"GeneralSettings.InputSettings" = "INPUT SETTINGS";
"GeneralSettings.GeneralSettings" = "GENERAL SETTINGS";

"GeneralSettings.SendByEnter" = "Use Enter to send ";
"GeneralSettings.SendByCmdEnter" = "Use ⌘ + Enter to send";

"Telegram.GeneralSettingsViewController" = "General Settings";
"AccountSettings.Logout" = "Wyloguj";
"NotificationSettings.ToggleNotifications" = "Powiadomienia";
"NotificationSettings.MessagesPreview" = "Podgląd wiadomości";
"NotificationSettings.NotificationTone" = "Dźwięki powiadomień";
"NotificationSettings.ResetNotifications" = "Resetuj powiadomienia";
"NotificationSettings.ResetNotificationsText" = "You can set custom notifications for specific chats below.";
"Telegram.NotificationSettingsViewController" = "Powiadomienia";
"DefaultSoundName" = "Domyślny";
"NotificationSettings.Tone.Default" = "Domyślny";
"NotificationSettingsToneNone" = "Brak";

"NotificationSettings.Confirm.Reset" = "Resetuj powiadomienia";

"Weekday.Friday" = "piątek";
"Weekday.Monday" = "poniedziałek";
"Weekday.Saturday" = "sobota";
"Weekday.ShortFriday" = "pią";
"Weekday.ShortMonday" = "pon";
"Weekday.ShortSaturday" = "sob";
"Weekday.ShortSunday" = "nie";
"Weekday.ShortThursday" = "czw";
"Weekday.ShortTuesday" = "wt";
"Weekday.ShortWednesday" = "śr";
"Weekday.Sunday" = "niedziela";
"Weekday.Thursday" = "czwartek";
"Weekday.Tuesday" = "wtorek";
"Weekday.Wednesday" = "środa";

"Time.at" = "o";
"Time.last_seen" = "ostatnio widziano";
"Time.today" = "dzisiaj";
"Time.tomorrow" = "jutro";
"Time.yesterday" = "wczoraj";


"Chat.EmptyChat" = "Tu jeszcze nie ma wiadomości";

"Chat.List.Sticker" = "%@ naklejka";
"Chat.List.Voice" = "Wiadomość głosowa";
"Chat.List.Video" = "Wideo";
"Chat.List.Photo" = "Zdjęcie";
"Chat.List.GIF" = "GIF";
"Chat.List.File" = "Plik";
"Chat.List.Map" = "Lokalizacja";
"Chat.List.Contact" = "Kontakt";

"UsernameSettings.ChangeDescription" = "Możesz wybrać nazwę użytkownika w Telegramie. Jeśli to zrobisz, inni będą mogli znaleźć cię przez tę nazwę i kontaktować się z tobą, nie znając twojego numeru telefonu.\n\n\nMożesz użyć a–z, 0–9 i podkreśleń. Minimalna długość nazwy to 5 znaków.";
"UsernameSettings.InputPlaceholder" = "Enter your username";
"Telegram.UsernameSettingsViewController" = "Nazwa użytkownika";
"UsernameSettings.available" = "Użytkownik %@ jest dostępny.";

"Error.Username.UnderscopeStart" = "A username can't start with an underscore.";
"Error.Username.UnderscopeEnd" = "A username can't end with an underscore.";
"Error.Username.NumberStart" = "Nazwa użytkownika nie może zaczynać się od numeru.";
"Error.Username.Invalid" = "Ta nazwa użytkownika jest niepoprawna.";
"Error.Username.MinimumLength" = "Nazwa użytkownika musi mieć co najmniej 5 znaków.";
"Error.Username.MaximumLength" = "A username can’t exceed 32 characters.";
"Error.Username.AlreadyTaken" = "Ta nazwa użytkownika jest już zajęta.";
"UsernameSettings.Done" = "Gotowe";

"Search.Separator.ChatsAndContacts" = "contacts and chats";
"Search.Separator.GlobalPeers" = "globalne wyszukiwanie";
"Search.Separator.Messages" = "wiadomości";
"Search.Separator.Recent" = "Ostatnie";
"Search.Separator.Popular" = "Ludzie";
"PeerInfo.AdminLabel" = "administrator";
"Share.Link.Copied" = "Skopiowano do schowka";


"Presence.bot" = "bot";
"Presence.offline" = "offline";
"CreateGroup.NameHolder" = "Nazwa grupy";
"Telegram.ChannelIntroViewController" = "Kanał";
"Channel.IntroDescriptionHeader" = "Czym jest kanał?";
"Channel.IntroDescription" = "Kanały to narzędzie do transmisji twoich wiadomości do wielu odbiorców jednocześnie.";
"Channel.Create" = "Utwórz";
"Channel.NewChannel" = "Nowy kanał";
"Group.CreateGroup" = "Nowa grupa";
"Compose.Create" = "Utwórz";
"Compose.Next" = "Dalej";
"Channel.ChannelNameHolder" = "Nazwa kanału";
"Channel.DescriptionHolder" = "Opis";
"Channel.DescriptionHolderDescrpiton" = "Opcjonalnie możesz podać opis dla tego kanału.";
"Channel.Channel" = "Kanał";


"Channel.TypeHeaderChannel" = "TYP KANAŁU";
"Channel.TypeHeaderGroup" = "TYP GRUPY";


"Channel.Public" = "Publiczny";
"Channel.Private" = "Prywatny";


"Channel.PrivateAboutChannel" = "Do prywatnego kanału można dołączyć tylko przez link zaproszenia.";
"Channel.PublicAboutChannel" = "Kanały publiczne można znaleźć w wyszukiwarce, każdy może do nich dołączyć.";
"Channel.PrivateAboutGroup" = "Do prywatnych grup można dołączyć tylko wtedy, gdy masz zaproszenie lub link zaproszenia.";
"Channel.PublicAboutGroup" = "Grupy publiczne można znaleźć w wyszukiwarce, historia czatu jest dostępna dla wszystkich i każdy może dołączyć.";

"Channel.PublicNamesLimitError" = "Przykro nam, zarezerwowałeś za dużo publicznych nazw użytkownika. Możesz unieważnić link z jednej ze starszych grup albo kanałów, lub zamiast tego stworzyć prywatną jednostkę.";


"Channel.ExportLinkAboutChannel" = "Ludzie mogą dołączyć do kanału za pomocą tego linku. Link można unieważnić w dowolnym momencie.";
"Channel.ExportLinkAboutGroup" = "Ludzie mogą dołączyć do kanału za pomocą tego linku. Link można unieważnić w dowolnym momencie.";
"Channel.UsernameAboutChannel" = "Ludzie mogą udostępniać ten link innym i znaleźć twój kanał przy użyciu wyszukiwania w Telegramie.";
"Channel.UsernameAboutGroup" = "Ludzie mogą udostępniać ten link innym i znaleźć twoją grupę przy użyciu wyszukiwania w Telegramie.";


"Group.NewGroup" = "Nowa grupa";

"Chat.Confirm.ActionUndonable" = "Ta czynność nie może być cofnięta.";
"Chat.Confirm.DeleteMessages" = "Delete selected messages?";
"Chat.Confirm.DeleteMessagesForEveryone" = "Usuń u wszystkich";

"Telegram.PrivacyAndSecurityViewController" = "Prywatność i bezpieczeństwo";
"PrivacySettings.PrivacyHeader" = "PRYWATNOŚĆ";
"PrivacySettings.BlockedUsers" = "Zablokowani użytkownicy";
"PrivacySettings.LastSeen" = "Ostatnio widziano";
"PrivacySettings.Groups" = "Grupy";
"PrivacySettings.SecurityHeader" = "BEZPIECZEŃSTWO";
"PrivacySettings.Passcode" = "Kod dostępu";
"PrivacySettings.ActiveSessions" = "Aktywne sesje";
"PrivacySettings.DeleteAccountHeader" = "USUŃ MOJE KONTO";
"PrivacySettings.DeleteAccount" = "Jeśli jestem nieaktywny przez";
"PrivacySettings.DeleteAccountDescription" = "Jeśli nie zalogujesz się na swoje konto w tym czasie choć raz, zostanie ono usunięte a wraz z nim grupy, wiadomości oraz kontakty.";
"PrivacySettings.TwoStepVerification" = "Weryfikacja dwustopniowa";

"Telegram.PasscodeSettingsViewController" = "Kod dostępu";
"Passcode.Placeholder" = "kod dostępu";
"Passcode.LogoutDescription" = "If you don't remember your passcode, you can";
"Passcode.LogoutLinkText" = "wyloguj";


"PreviewSender.SendFiles.zero" = "%d files selected";
"PreviewSender.SendFiles.singular" = "%d file selected";
"PreviewSender.SendFiles.pluar" = "%d files selected";

"PreviewSender.SendImages.zero" = "%d images selected";
"PreviewSender.SendImages.singular" = "%d image selected";
"PreviewSender.SendImages.pluar" = "%d images selected";

"PreviewSender.SendVideos.zero" = "%d videos selected";
"PreviewSender.SendVideos.singular" = "%d video selected";
"PreviewSender.SendVideos.pluar" = "%d videos selected";

"PreviewSender.SendMediaFiles.zero" = "%d media files selected";
"PreviewSender.SendMediaFiles.singular" = "%d media file selected";
"PreviewSender.SendMediaFiles.pluar" = "%d media files selected";

"PreviewSender.ExpandItems" = "Expand";
"Chat.Input.StartBot" = "Start";

"InlineModalAction.Title" = "Udostępnij zawartość bota";
"InlineModalAction.Desc" = "Wybierz użytkownika lub czat aby udostępnić treści za pośrednictwem %@";

"Telegram.PasswordViewController" = "Weryfikacja dwustopniowa";


"ChatList.Context.StopBot" = "Zatrzymaj bota";
"ChatList.Context.Unmute" = "Włącz powiadomienia";
"ChatList.Context.Mute" = "Wyłącz  powiadomienia";
"ChatList.Context.Block" = "Blokuj użytkownika";
"ChatList.Context.ClearHistory" = "Wyczyść historię";
"ChatList.Context.DeleteChat" = "Usuń czat";
"ChatList.Context.DeleteAndExit" = "Usuń i wyjdź";
"ChatList.Context.LeaveChannel" = "Opuść kanał";
"ChatList.Context.LeaveGroup" = "Opuść grupę";
"ChatList.Context.ReturnGroup" = "Return Group";
"ChatList.Context.Pin" = "Przypnij";
"ChatList.Context.Unpin" = "Odepnij";

"ChatList.SecretChat.Terminated" = "Anulowano szyfrowany czat";
"ChatList.SecretChat.Joined" = "Użytkownik %@ dołączył do twojego szyfrowanego czatu.";
"ChatList.SecretChat.Created" = "%@ created a secret chat.";
"ChatList.SecretChat.ExKeys" = "Waiting to come online";

"ChatList.UnsupportedMessage" = "Message is not supported";
"Chat.Message.Unsupported" = "This message is not supported by your version of Telegram. Please update to the latest version via Settings or install it from https://macos.telegram.org";
"Text.Copy" = "Copy";


"Peer.Activity.User.TypingText" = "pisze";
"Peer.Activity.User.SendingPhoto" = "wysyła zdjęcie";
"Peer.Activity.User.RecordingVideo" = "nagrywa wideo";
"Peer.Activity.User.SendingVideo" = "wysyła wideo";
"Peer.Activity.User.RecordingAudio" = "recording voice";
"Peer.Activity.User.SendingAudio" = "wysyła audio";
"Peer.Activity.User.SendingFile" = "wysyła plik";
"Peer.Activity.User.PlayingGame" = "gra w grę";

"Peer.Activity.Chat.Single.TypingText" = "%@ pisze";
"Peer.Activity.Chat.Single.SendingPhoto" = "%@ wysyła zdjęcie";
"Peer.Activity.Chat.Single.RecordingVideo" = "%@ nagrywa wideo";
"Peer.Activity.Chat.Single.SendingVideo" = "%@ wysyła wideo";
"Peer.Activity.Chat.Single.RecordingAudio" = "%@ is recording voice";
"Peer.Activity.Chat.Single.SendingAudio" = "%@ wysyła audio";
"Peer.Activity.Chat.Single.SendingFile" = "%@ wysyła plik";
"Peer.Activity.Chat.Single.PlayingGame" = "%@ gra";

"Peer.Activity.Chat.Multi.TypingText" = "%d pisze";
"Peer.Activity.Chat.Multi.SendingPhoto" = "%d are sending photo";
"Peer.Activity.Chat.Multi.RecordingVideo" = "%d are recording video";
"Peer.Activity.Chat.Multi.SendingVideo" = "%d are sending video";
"Peer.Activity.Chat.Multi.RecordingAudio" = "%d are recording voice";
"Peer.Activity.Chat.Multi.SendingAudio" = "%d are sending audio";
"Peer.Activity.Chat.Multi.SendingFile" = "%d are sending file";
"Peer.Activity.Chat.Multi.PlayingGame" = "%d are playing a game";

"Peer.Media.SharedMediaEmptyList" = "Udostępniaj zdjęcia i wideo w tym czacie – lub ten spinacz pozostanie zmartwiony.";
"Peer.Media.SharedFilesEmptyList" = "Można wysyłać i odbierać pliki dowolnego typu do 1,5 GB każdy, i mieć do nich dostęp w dowolnym miejscu.";
"Peer.Media.SharedLinksEmptyList" = "Wszystkie linki udostępnione w tym czacie pojawią się tutaj.";
"Peer.Media.SharedMusicEmptyList" = "All music shared in this chat will appear here.";

"SecretTimer.Off" = "Wyłączony";


"Timer.Seconds.zero" = "%d seconds";
"Timer.Seconds.singular" = "%d second";
"Timer.Seconds.pluar" = "%d second";
"Timer.Days.zero" = "%d days";
"Timer.Days.singular" = "%d dzień";
"Timer.Days.pluar" = "%d days";
"Timer.Minutes.zero" = "%d minutes";
"Timer.Minutes.singular" = "%d minute";
"Timer.Minutes.pluar" = "%d minutes";
"Timer.Hours.zero" = "%d hours";
"Timer.Hours.singular" = "%d hour";
"Timer.Hours.pluar" = "%d hours";
"Timer.Weeks.zero" = "%d weeks";
"Timer.Weeks.singular" = "%d week";
"Timer.Weeks.pluar" = "%d weeks";
"Timer.Months.zero" = "%d months";
"Timer.Months.singular" = "%d month";
"Timer.Months.pluar" = "%d months";
"Timer.Years.zero" = "%d years";
"Timer.Years.singular" = "%d year";
"Timer.Years.pluar" = "%d years";

"ChatList.Draft" = "Szkic";
"ChatList.You" = "Ty";

"Notification.LockedPreview" = "Masz nową wiadomość";
"JoinLink.Join" = "Dołącz";

"Group.Unavailable" = "Wydaje się, że ta grupa nie istnieje.";

"Chat.Title.self" = "Twój dysk w chmurze";
"Separator.ShowMore" = "Pokaż więcej";
"Separator.ShowLess" = "Pokaż mniej";
"Stickers.Recent" = "Ostatnie";
"Account.Confirm.AskQuestion" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while. \n\nPlease take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"Account.Confirm.GoToFaq" = "Open FAQ";

"Chat.SecretChat.EmptyHeader" = "Szyfrowane czaty";
"Chat.SecretChat.1Feature" = " - Używają pełnego szyfrowania";
"Chat.SecretChat.2Feature" = " - Nie pozostawiają śladu na naszych serwerach";
"Chat.SecretChat.3Feature" = " - Mają timer autodestrukcji";
"Chat.SecretChat.4Feature" = " - Nie pozwalają przekazywać";


"TextView.Transform.Bold" = "Make Bold";
"TextView.Transform.Italic" = "Make Italic";
"TextView.Transform.Code" = "Make Monospace";
"AccountsController.NewAccount" = "New Account";
"Telegram.AccountsListViewController" = "Account Management";

"Account.Confirm.Logout" = "Wylogować?";
"Account.Confirm.LogoutText" = "Remember, logging out cancels all your Secret Chats.";

"Telegram.ConvertGroupViewController" = "Super grupa";

"Supergroup.Convert.Description" = "**W super grupie:**\n\n• Nowi członkowie mogą widzieć całą historię wiadomości\n• Usunięte wiadomości będą niewidoczne dla wszystkich członków\n• Administratorzy mogą przypinać ważne wiadomości\n• Twórca może ustawiać publiczny link dla grupy";
"Supergroup.Convert.Undone" = "**Uwaga**: Ta czynność nie może być cofnięta.";
"Supergroup.Convert.Button" = "Konwertuj do super grupy";


"PeerInfo.InviteLink" = "Link zaproszenia";
"PeerInfo.MembersHeader" = "CZŁONKÓW - %d";
"PeerInfo.Admins" = "Administratorzy";
"PeerInfo.BlackList" = "Czarna lista";
"PeerInfo.SetAdmins" = "Set Admins";
"PeerInfo.GroupType" = "Typ grupy";
"PeerInfo.ChannelType" = "Typ kanału";
"PeerInfo.GroupType.Public" = "Publiczny";
"PeerInfo.GroupType.Private" = "Prywatny";
"PeerInfo.SetAboutDescription" = "Opcjonalnie możesz podać opis dla tej grupy.";
"PeerInfo.About.Placeholder" = "Opis";
"PeerInfo.ConvertToSupergroup" = "Konwertuj do super grupy";

"Telegram.ChannelBlacklistViewController" = "Czarna lista";
"Telegram.ChannelAdminsViewController" = "Administratorzy";

"ChannelBlacklist.EmptyDescrpition" = "Użytkownicy z czarnej listy zostali usunięci z grupy i mogą do niej powrócić tylko po zaproszeniu przez administratora.\nZaproszenia w formie linku nie działają dla nich.";

"Admins.GroupAdmins" = "GROUP ADMINS";
"Admins.ChannelAdmins" = "CHANNEL ADMINS";

"Admins.OnlyAdminsCanAddMembers" = "Only Admins can add new members";
"Admins.EverbodyCanAddMembers" = "Everybody can add new members";
"Admins.GroupDescription" = "Możesz dodać administratorów, by pomagali ci zarządzać grupą.";
"Admins.ChannelDescription" = "Możesz dodać administratorów, by pomagali ci zarządzać kanałem.";
"Admins.SelectNewAdminTitle" = "Kontakty";
"Admins.AddPeerAsAdmin" = "Add \"%@\" as admin?";
"Admins.AddAdmin" = "Dodaj administratora";
"Admins.Creator" = "Twórca";
"Admins.Admin" = "Administrator";
"Admins.Moderator" = "Moderator";
"Admins.WhoCanInvite.Text" = "Kto może dodawać członków";
"Admins.WhoCanInvite.Admins" = "Tylko administratorzy";
"Admins.WhoCanInvite.Everyone" = "Wszyscy członkowie";

"Telegram.ChannelVisibilityController" = "Grupa";
"PeerInfo.Confirm.AddMembers" = "Add %d users to group?";
"PeerInfo.Confirm.AddMember" = "Add \"%@\" to group?";
"PeerInfo.Confirm.RemovePeer" = "Remove \"%@\" from group?";

"PeerInfo.FirstName.Placeholder" = "Imię";
"PeerInfo.LastName.Placeholder" = "Nazwisko";
"PeerInfo.GroupName.Placeholder" = "Nazwa grupy";
"PeerInfo.ChannelName.Placeholder" = "Nazwa kanału";
"PeerInfo.Phone" = "telefon";

"ConvertToSupergroup.Alert.Error" = "Something is wrong, please try again later.";
"ConvertToSuperGroup.Confirm" = "Jesteś pewny? Ta czynność nie może być cofnięta.";
"Telegram.LinkInvationController" = "Link zaproszenia";

"GroupInvation.CopyLink" = "Kopiuj link";
"GroupInvation.Revoke" = "Unieważnij";
"GroupInvation.Share" = "Udostęnij link";

"GroupInvation.GroupDescription" = "Anyone who has Telegram installed will be able to join your group by following this link";
"GroupInvation.ChannelDescription" = "Anyone who has Telegram installed will be able to join your channel by following this link";

"Chat.Header.PinnedMessage" = "Przypięta wiadomość";
"Chat.Header.ReportSpam" = "Zgłoś spam";
"Chat.Confirm.Unpin" = "Chcesz odpiąć tę wiadomość?";

"StickerPack.Add" = "Dodaj naklejek - %d";
"Compose.Select.SecretChat" = "Szyfrowany czat";
"Compose.Confirm.StartSecretChat" = "Create secret chat with \"%@\"";
"StickerPack.Remove" = "Remove %d stickers";

"ReportReason.Spam" = "Spam";
"ReportReason.Violence" = "Przemoc";
"ReportReason.Porno" = "Pornografia";
"PeerInfo.ChannelReported" = "Thank You! Your report will be reviewed by our team very soon.";

"PeerInfo.SignMessages.Desc" = "Dodaje nazwy administratorów do wiadomości, które oni publikują.";
"PeerInfo.SignMessages" = "Podpisuj wiadomości";
"PeerInfo.SetChannelPhoto" = "Ustaw zdjęcie kanału";
"PeerInfo.Members" = "Członkowie";
"PeerInfo.ChannelLink" = "Link";
"PeerInfo.DeleteChannel" = "Usuń kanał";
"PeerInfo.DeleteSecretChat" = "Usuń szyfrowany czat";

"ChannelMembers.AddMembers" = "Dodaj członka";
"ChannelMembers.InviteLink" = "Zaproś poprzez link";
"ChannelMembers.MembersListDesc" = "Tylko administratorzy kanału widzą tę listę.";
"Telegram.ChannelMembersViewController" = "Channel Members";

"LinkInvation.Group.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the group using it.";
"LinkInvation.Channel.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the channel using it.";
"LinkInvation.Confirm.Ok" = "Unieważnij";
"ChannelMembers.Select.Title" = "Add Members";
"PeerInfo.Confirm.StartSecretChat" = "Are you sure you want to start a secret chat with \"%@\"?";


"PeerInfo.BotStatus.HasNoAccess" = "nie ma dostępu do wiadomości";
"PeerInfo.BotStatus.HasAccess" = "ma dostęp do wiadomości";
"PeerInfo.GroupsInCommon" = "Wspólne grupy";
"GroupsInCommon.Empty" = "No groups in common";
"Telegram.GroupsInCommonViewController" = "Wspólne grupy";

"ChannelVisibility.Checking" = "Checking";
"ChannelVisibility.Loading" = "Wczytywanie…";
"Peer.DeletedUser" = "Deleted User";

"ChatList.Service.Call.incoming" = "Połączenie przychodzące (%@)";
"ChatList.Service.Call.outgoing" = "Outgoing Call (%@)";
"ChatList.Service.Call.Cancelled" = "Cancelled Call";

"ChatList.Service.Call.Missed" = "Missed Call";
"ChatList.Service.Call.busy" = "Zajęte";
"ChatList.Service.Call.Hangup" = "Hangup";
"ChatList.Service.Call.Disconnected" = "Disconnected";

"ChatList.Service.GameScored" = "uzyskano punktów - %d w %@";


"About.Description" = "Free messaging app for macOS based on MTProto for speed and security.";
"ChatService.ChannelCreated" = "kanał został utworzony";
"Telegram.BlockedPeersViewController" = "Zablokowani użytkownicy";
"BlockedPeers.EmptyDescrpition" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";

"Sessions.CurrentSessionHeader" = "BIEŻĄCA SESJA";
"Sessions.TerminateOthers" = "Zakończ wszystkie inne sesje";
"Sessions.TerminateDescription" = "Logs out all devices except for this one.";
"Sessions.ActiveSessionsHeader" = "AKTYWNE SESJE";


"Passcode.TurnOn" = "Włącz kod dostępu";
"Passcode.TurnOnDescription" = "When you set up an additional passcode, you can use ⌘ + L for lock.\n\nNote: if you forget the passcode, you'll need to delete and reinstall the app. All secret chats will be lost.";
"Passcode.TurnOff" = "Wyłącz kod dostępu";
"Passcode.Change" = "Zmień kod dostępu";
"Passcode.Autolock" = "Automatyczna blokada";
"Passcode.AutoLock.Disabled" = "Wyłączony";
"Passcode.AutoLock.IfAway" = "Jeśli nieaktywny przez %@";

"Passcode.EnterPasscodePlaceholder" = "Enter a passcode";
"Passcode.ReEnterPlaceholder" = "Re-enter a passcode";
"Passcode.EnterCurrentPlaceholder" = "Enter Current Passcode";
"Passcode.EnterNewPlaceholder" = "Enter New Passcode";

"Passcode.Next" = "Dalej";


"Peer.ServiceNotifications" = "powiadomienia serwisowe";

"Alert.SendError.Header" = "Twoja wiadomość nie może być wysłana";
"Alert.SendError.Text" = "Wystąpił błąd podczas wysyłania poprzedniej wiadomości. Chcesz ją wysłać ponownie?";
"Alert.SendError.Resend" = "Wyślij ponownie";
"Alert.SendError.Delete" = "Usuń";
"Alert.SendError.Ignore" = "Ignoruj";

"GeneralSettings.EnableSidebar" = "Sidebar";
"GeneralSettings.SidebarDescription" = "Stickers and Emoji will appear on the right of chat.";
"Telegram.RecentSessionsController" = "Aktywne sesje";
"RecentSessions.Confirm.TerminateOthers" = "Are you sure you want to terminate all other sessions?";
"RecentSessions.Confirm.Revoke" = "Do you want to terminate this session?";
"RecentSessions.Revoke" = "Unieważnij";

"Legacy.Intro.Description1" = "Welcome to the new super-fast and stable Telegram for macOS, fully rewritten in Swift 3.0.";
"Legacy.Intro.Description2" = "Please note that your existing secret chats will be available in read-only mode. You can of course create new ones to continue chatting.";
"Legacy.Intro.Next" = "Uruchom komunikator";

"Messages.ReplyLoading.Header" = "Odpowiedz";
"Messages.ReplyLoading.Loading" = "Wczytywanie…";
"PeerInfo.DeleteContact" = "Usuń kontakt";
"PeerInfo.Confirm.DeleteContact" = "Usunąć kontakt?";
"Compose.SelectUsers" = "Select users";
"PeerInfo.AddContact" = "Dodaj kontakt";
"Telegram.GroupAdminsController" = "Administratorzy";
"GroupAdmins.AllMembersAdmins" = "Wszyscy członkowie są administratorami";
"GroupAdmins.Desc.AdminInvites" = "Tylko administratorzy mogą dodawać i usuwać członków, edytować nazwę i zdjęcie tej grupy.";
"GroupAdmins.Desc.AllInvites" = "Group members can add new members, edit name and photo of this group.";
"Login.PhoneNumberNotRegistred" = "Phone number not registered. If you don't have a Telegram account yet, please sign up with your mobile device.";
"Login.Unregistred.OpenSite" = "Open Site";
"PeerInfo.EncryptionKey" = "Klucz szyfrujący";

"Telegram.SecretChatKeyViewController" = "Klucz szyfrujący";
"EncryptionKey.Description" = "This image and text were derived from the encryption key for this secret chat with **%@**.\n\nIf they look the same on %2$@'s device, end-to-end encryption is guaranteed.";


"GeneralSettings.InAppSounds" = "Dźwięk w aplikacji:";
"Chat.ShareInlineResultActionHeader" = "Udostęnij";
"Context.CopyMedia" = "Zapisz jako…";

"Telegram.InstalledStickerPacksController" = "Naklejki";
"Stickers.Set.Count" = "%d stickers";
"Telegram.FeaturedStickerPacksController" = "Popularne naklejki";
"Telegram.ArchivedStickerPacksController" = "Archiwalne naklejki";
"ArchivedStickers.Description" = "Możesz mieć zainstalowanych maksymalnie 200 zestawów naklejek. Nieużywane naklejki są archiwizowane podczas dodawania następnych.";
"InstalledStickers.PacksTitle" = "PAKIETY NAKLEJEK";
"InstalledStickers.Descrpiption" = "Zachęcamy artystów do dodawania własnych zestawów naklejek za pomocą bota @stickers.\n\nKliknij naklejkę, by obejrzeć i dodać cały zestaw.";
"InstalledStickers.Archived" = "Archived Stickers";
"InstalledStickers.Tranding" = "Popularne naklejki";
"StickerSet.Remove" = "Usuń";
"InstalledStickers.Remove.Description" = "Stickers will be archived, you can quickly restore it later from the Archived Stickers section.";
"InstalledStickers.Remove.Delete" = "Usuń";
"InstalledStickers.Remove.Archive" = "Archiwizuj";
"Alert.UserDoesntExists" = "Sorry, this user doesn't seem to exist.";
